{
	"colors":{
		"European Police Cooperation":{
			"color":"0x046380",
			"hover":"0x0c0901",
			"text":"0xffffff"
		},
		"Community Developpments":{
			"color":"0x7EB74B",
			"hover":"0x5A7302",
			"text":"0xffffff"
		},
		"EU databases and information network":{
			"color":"0xF7BB44",
			"hover":"0xFFD200",
			"text":"0xffffff"	
		},
		"External Dimension":{
			"color":"0xBF0436",
			"hover":"0x590202",
			"text":"0xffffff"
		}
	},
	"orders":[
		"European Police Cooperation",
		"Community Developpments",
		"EU databases and information network",
		"External Dimension"
	],
	"nodes": {
		"controller":[
			{"id":"control","events":{
				"2012": " " 
			}}
		],
		"European Police Cooperation": [
			{"id":"Mutual Assistance Group","events":{
                "1967": "Naples Convention, group established and composed of representatives to customs administrationsImportant role in the developpment of fight against transnational organised crime",
                "1985": "Scope expanded to Drugs, Visa and Borders",
                "1986": "Expanded scope to Immigration",
                "1992": "Creation of a sub group GAM 92 which analyses the effects of europeanisation and free movement"
            }},
			{"id":"Berne Club","events":{
                "1971": "Met with other members of the Council of EuropeInformation obtained via US Intelligence serviceFocused at first on Terrorismanalysis on the Middle EastCreated groups on 'threat', 'police methods' Came up with the idea to collect falsified arab docu-ments ",
                "1981": "expanded scope to International Crime, Visa, Borders",
                "1985": "Expanded scope to Immigration",
                "1991": "expanded scope to fraud, Trans-borders and Asylum"
            }},
			{"id":"Pompidou group","events":{
                "1971": "Permanent Group is set up to combat drug abuse and illegal trafficking in drugs; composed of ministers and civil servants",
                "1979": "Expandes scope to International Crime, Fraud and Trans-borders",
                "1980": "Turquey enters the club",
                "1981": "Greece enters the club",
                "1983": "Norway enters the club",
                "1984": "Spain enters the club. Expands Scope to Visa ans Borders",
                "1985": "Portugal and Switzerland enters",
                "1986": "Finland enters",
                "1987": "Austria and Malta entered the group"
            }},
			{"id":"Star Group (Standige Arbeitsgruppe Rauschgift)","events":{
                "1972": "Ger, Fr, NL, Lux, Dk, Switzerland, AusFocused on DrugsUnder german responsibilityArbeitsgruppe SüdostGerman Länders establish groups with their neighbours Bavière, Aus, Bulgaria, Hungary, Romania, Yougoslavia and Canada",
                "1973": "Expanded focus on International Crime",
                "1976": "Expanded focus on International Crime",
                "1978": "Arbeitsgruppe Nord German Länders establish groups with their neighbours Brême, Hambourg, Basse saxe Schleswig-Holstein Berlin and NL, Dk, Sw, Norw, Fin",
                "1979":"Arbeitsgruppe Südwest German Länders establish groups with their neighbours Bade-Wurtenberg, Fr, It, Au, Swit, US"
            }},
			{"id":"TREVI Group","events":{
                "1975": "European Council in Europe agreed to create abody for cooperation in policing and criminaljustice >> TREVI groupStands for the french words terrorism, radicalismeextrémisme et violence internationaleTriple objective: exchange information on terroristthreat, exchange information on the equipement and training of police forces, cooperate in the fight against terrorism Criminal justice cooperation which operated at threelevels. Was composed of electedofficials (justice and interior minister who meet everysix months), policy experts (civilian bureaucrats whoprepare reports and coordinate operations of 3rd  level) and practitionners (policemen)Highly intergovernmental organisationCreation came in response to terrorists activities of European and non-European origin.Leadership relied upon a Troïka consisting of the past present and next chair of the ministerial group.international dimension: meeting with non EU MS",
                "1976": "1st meeting (1st June) in Luxembourg",
            	"1977": "Establishments of Working Groups: police officers meet in seminars and workshops who prepare the TREVI conferences Working Group 1 was created on 31st May on Terrorism activities: internal security intelligence links",
            	"1978": "Working Group 2 is created : information exchange on police training, equipment, forensic science, public order… adhoc WG: extradition, immigration",
            	"1985": "Soccer hooliganism leads to 39deaths at Heysel stadium, Brussels. June: added soccer hooliganism to scope of WG2 Establishment of WG3 to handle serious forms of international organised crime, drug trafficking, money laundering, Aim of WG3 was to facilitate the exchange of information and expertise joint development of research techniques. Developped guidelines for establishing a system of drug liaison officers in Member States, producer and transit countries",
            	"1987": "Ministers approved guidelines for establishing drug liaison offices. These are the intitial steps in creation of EUROPOL",
            	"1989": "Troïka replaced by leadership  organised around the current chair, the 2 preceeding ones and the next two: Piatnika In June the TREVI ministers adopted 1: a program of action prepapred by the TREVI 92: meetings of border patrols officials; police 'hot pursuit' accross borders; joint information systems adopted the plan drafted by WG 3: creation of a network of national drug intelligence units in each MS for the pooling of information"
            }},
			{"id":"Kilowatt group","events":{
            	"1977": "Establishement of the informal group at the international level.Exchange of information between intelligence service of european countries, US and Israël"
            }},
			{"id":"Vienne Group","events":{
            	"1979":"Establishement of the group It is an extension of TREVI and Berne Meeting of Ministers and High level civil servants from Austria, Switzerland,France, Germany focused on illegal immigration, asylum seekers"
            }},
			{"id":"Quantico Group","events":{
            	"1979":"Transnational character civil servants from Germany, Australia, Canada, United-States, France, United-Kingdom and Sweden Focused on inernational diasporas- Terrorism Information obtained via US Intelligence service",
            	"1982": "Expanded scope to International Crime"
            }},
			{"id":"Police Working Group on Terrorism (PWGOT)","events":{
            	"1979":"Netherlands, Belgium, France, Germany, United-Kingdom. Exchange of information on terrorist (IRA), surveillance of network supplying",
            	"1991":"Scope expanded to fraud and Trans-borders"
            }},
			{"id":"AD HOC Immigration Group","events":{
            	"1986": "Created by Member States ministers responsible for immigration matters (ministers of interior) to analyse the impact and conditions of free movement (visa, asylum, exterior border crossing) on internal security, Establishement of six sub groups. Deals with exterior border surveillance, implementation of a computer system like Schengen Information System (SIS) European Commission has an observer status"	
            }},
			{"id":"Orphelin Group","events":{
            	"1986": "Judicial cooperation is organised through the 'Orphelin Group', created under Italian presidency. Group adopted by the European Political Cooperation non institutional structure designed to coordinate the foreign policy of the MS 7 Agreements have been adopted in the criminal field between 1987 and 1991, however these agreements have not been ratified and therfore are not applicable"	
            }},
			{"id":"Ad Hoc Working Group on Europol","events":{
            	"1991":"In August the TREVI minsiters established an ad hoc Working Group on EUROPOL"
            }},
			{"id":"Ad hoc group Organised International Crime","events":{
            	"1992":"Group composed of legal experts, promoted a uniform definition of organised crime and preventive and punitive measures; Difficult developpment considering the other operational grops in the field"
            }},
			{"id":"EUROPOL Project Group","events":{
            	"1992":"In June the TREVI ministers agree to establish the Europol Project Group"
            }},
			{"id":"Treaty of Prüm","events":{
            	"2005":"7 EU MS signed an Agreement on the 27th May 2005. Belgium, Germany, Spain, France, Luxembourg, Netherlands and Austria. The aim of the Treaty is to help the signatories improve crime in information-sharing for the purpose of preventing and combating three fields, all of which are covered by provisions of EU Treaty: terrorism, cross-border crime and illegal migration. Provides the signatories with certain rights of access to DNA only in repressive context (prosecution of crime), ingerprint data, personal and non-personal data, as well as vehicle registration data in both preventive and repressive context. The Treaty of Prüm increases law enforcement by allowing for ‘joint patrols and other operations in which designated officers or other officials […] from other contracting Parties participate in operations within a Contracting Party’s territory.’ In addition, in urgent situation, officers from one Contracting Party may, without another Contracting Party’s prior consent, cross the border between the two so that, within an area of the other Contracting Party’s territory close to the border […] they can take any provisional measures necessary to avert imminent danger to the integrity of individuals.’ (Articles 24 and 25) The datas are controlled by the contracting parties via their national contact points and these entities have acess and can process the data"	
            }}
        ],
		"Community Developpments":[
			{"id":"EC enlargement","events":{
				"1973":"United-Kingdom, Ireland and Denmark",
				"1981":"Greece",
				"1986":"Spain and Portugal",
				"1995":"Finalnd, Sweeden, Austria",
				"2004":"Estonia, Latvia, Lituania, Poland, Czech Republic, Slovakia, Hungary, Slovenia, Cyprus, Malta",
				"2007":"Bulagria and Romania"
			}},
			{"id":"Saarbrücken Agreement","events":{
				"1984":"France and Germany agree to abolish controls at their mutual border"
			}},
			{"id":"Schengen Agreement","events":{
				"1985":"In June the Schengen Agreement is signed between France, Germany and Benelux countries. Agreement to establish the abolishment of borders at common borders. Embodied specific provisions for creating the common, central computer network = Schengen Information System (SIS); and liaison civil servants for transnational cooperation. Needs ratification to be into force",
				"1986":"Jan: First Schengen pracical measure: abolish truck controls and creation of a green stamp fo tourist vehi- cules" ,
				"1990":"In June the Schengen Implementation Convention is signed abolishing the internal borders and implementing the external borders, police, judicial and custom cooperation. It embodied specific provisions for creating the common, central computer network = Schengen Information System (SIS); and liaison civil servants for transnational cooperation Needs ratification to be into force SIS: central storage system in the fight agains interna tional crime, terrorism, illegal migration and political activism",
				"1995":"In March, Schengen Implementation Agreement takes effect: Free travel zone created among Germany, France, Belgium, Spain, Netherlands, Luxembourg and Portugal",
				"1997":"In October, Italy implements Schengen agreement for air travel",
				"1998":"In April, Austria implements Schengen Agreement, removes border controls for travel by land and sea",
				"2000":"March: Greece implement the Schengen agreement",
				"2001":"In March: Denmark, Sweden and Finland, abolish borders",
				"2008":"Switzerland intergrated the Schengen area in December",
				"2011":"Following the veto from Finland and the Netherlands, Bulgaria and Romania are prevented from joining the Schengen area altogether. A partial accession concerning air travel is examined for October"

			}},
			{"id":"Single European Act (SEA)","events":{
				"1986":"In Febuary the Single European Act is signed. Establishes free movement of persons, goods, capitals and services as a basic prinicple for the common market",
				"1987":"In July : Entry into force of the SEA, goal is to perfect the common market by end of 1993 inclusion of the 'cooperation procedure' within the European Parliament for a certain number of policies"
			}},
			{"id":"Group on Terrorism","events":{
				"1986":"Ministries of foreign affairs estblished a group on Terrorism among the European Political Cooperation. Organised through a permanent secretariat within the European Commission, the group confirmed decisions taken by TREVI in the form of General Sta- tement"
			}},
			{"id":"Rhodes Group","events":{
				"1988":"Creation of the 'Rhodes group' by the European Council also know as the coordinator group, Appointement of minister of interior or foreign affairs. Mission is to relaunch the work on terrorism, drugs, police cooperation, compensatory measures and to grasp a global view",
				"1989":"In June the Palma document embodies the list of measures to be adopted in order to abolish the borders Group monitors the calendar established"
			}},
			{"id":"European Drugs Monitoring Centre","events":{
				"1989":"Renovation of the Pomidou Group and creation of the European Drugs Monitoring Centre. Worked for the implementation of the drugs observatory intergarted the European Information Network on drugs and addictions. Members are representant of the Commission and the General Secretariat of the Council"
			}},
			{"id":"European Drugs Intellingence Unit","events":{
				"1990":"In July the European Council approved plan of WG3 European Drugs Intellingence Unit created and coordinates drug liaison officers"
			}},
			{"id":"Dublin Convention","events":{
				"1990":"In June, Signature of the Dulin Convention by 11 MS: detemining which MS state is responsible for examining the asylum request introduced by the asylum seeker Once ratified by all MS, provisions reagding asylum in Schengen Agreement are void",
				"1997":"In September, entry into force of the Dublin Convention. 12 ratifications were necessary"
			}},
			{"id":"Maastrich, Amsterdam, Lisbon Treaties","events":{
				"1991":"In December the European Council in Maastrcih unveils Treaty on European Union (TEU) , calls for Europol in its Title VI Articles K1 -K9 A two phase approach is decided, first one focused on drugs, second focus on a Europol convention",
				"1992":"Signature of the Treaty by the EU MS",
				"1993":"In November the Treaty enters into Force European Parliament gains power of codecision for some policies; European Union is created; Title IV replaces the TREVI Group with intergovernmental",
				"1997":"In October, Signature of Treaty of Amsterdam (TEU): transfer of free movement policy areas of Pillar 3 to Pillar 1; incorporation of Schengen acquis into EU; some operative powers for Europol",
				"1998":"Signature of the Amsterdam Treaty",
				"1999":"In May, entry into force of the Treaty of Amsterdam. K4 Committee becomes Article 36 Committee. Schengen acquis integrated into EU legislation",
				"2009":"The Lisbon treaty entered into force on 1 December. The realisation of the AFSJ becomes the second objective of the EU (Article 3(2) TEU). The AFSJ is now an area of shared competence between the Member States and the EU (Article 4(2) TFEU) where the ordinary legislative procedure (Article 289 & 290 TFEU) applies. Article 10 of Protocol No. 36 annexed to the Lisbon treaty stipulates that the full powers of the European Commission and the ECJ in the field of police and juidicial cooperation in criminal matters (former Third Pillar) will only apply following a transitional period of 5 years. In specific areas related to the AFSJ, particularly in the field of operational cooperation in internal security matters, special legislative procedures remain in placec (Article 87(3) TFEU)"
			}},
			{"id":"TREVI 92","events":{
				"1988": "Dec: Establishment of the 'TREVI 92' WG (WG4) to study the implications of a Community without borders and the consequences of the abolishment of the control of individuals, worked ont the compensatory measures to free movement",
            	"1992": "In June the TREVI Group Ministerial Agreement established Europol Drugs Unit (EDU). "	
            }},
			{"id":"Council Working Structures","events":{
				"1992":"Ad Hoc Immigration Group implemented: the CIREA, the Information, Reflection and Exchange Centre, to coordinate and improve the compilation, exchange and dissemination of information as well as the preparation of joint docu- mentation in the field of asylum between MS Its not a Centre but a task force. It also implemented the CIREFI, Centre for Information, Discussion and Exchange on the Crossing of Borders and Immigration. CIREFI represents the couterpart to the so illegal migration. It was implemented to collect information on legal and illegal fows, methods employed by illiegal immigrants, valid and falsified document, rejected asylum seekers, abusie asylum request, deportations connection avec le groupe Ad hoc Immigration group",
				"1993":"CIREA created a new statistical system for determini ning the number of asylum applicants and refugee status recognition rates in the individual Member countries. -- Establishment of K.4 committee in relation with the entry into force of the Maastricht treaty and its Title VI. The K.4 Committee is composed of 3 groups, Asylum and Immigration Police and customs; judicial cooperation. Creation of a full directorate-general for Justice and Home Affairs within the Council Secretariat",
				"1998":"Following the entry into force of the treaty of Amsterdam, the K.4. committee becomes the Article 36 committee (CATS) and is set to coordinate the work of the Council below the ministerial level with regard policing and criminal law proposals",
				"1999":"The Council establishes the Strategic Committee on Immigration, Frontiers and Asylum (SCIFA), initially as a five-year transitional measure, to coordinate matters related to the new Title IV TEC, depriving COREPER II of coordination powers in these matters",
				"1999":"Creation of the Committee on Civil Law matters to coordinate judicial cooperation matters within the scope of Article 65 TEC. The Committee reports to COREPER, and judicial matters are thus established independently from policing, immigration, borders and asylum matters",
				"2009":"COREPER examines the opportunity of revising the Council working structures in JHA matters. It decides that CATS and SCIFA should be maintained until 1 January 2012, at which point their necessity would be evaluated",
				"2010":"Creation of COSI following the entry into force of the Lisbon treaty, by means of Council Decision 2010/131/EU, on the basis of Article 71 TFEU (former Article 36). COSI takes over the operational remits of CATS and SCIFA"
			}},
			{"id":"Commission structures","events":{
				"1993":"Following the entry into force of the Maastricht treaty, a 'JHA task force' is established within the General Secretariat of the Commission",
				"1999":"Following the entry into force of the Amsterdam treaty, the JHA task force becomes a full directorate general. Officials from the former JHA task force are joined by officials from the former DG XV (internal market) dealing with freedom of movement for persons",
				"2004":"DG JHA becomes DG JLS following the appointment of the Barroso college of commissioners",
				"2010": "DG JLS is split between DG Home Affairs and DG Justice. A new commissioner portfolio is created to deal with matters related to justice, fundamental rights and citizenship" 
			}},
			{"id":"European agency for the operational management of large-scale IT systems","events":{
				"2009":"The European Commission submits a legislative package comprising a proposal for a Regulation of the European Parliament and of the Council on the establishment of the agency with a First Pillar legal basis, and a proposal for a Council Decision regarding the operational management of SIS II and VIS falling under Title VI (Third Pillar). The proposal is resubmitted in 2010 to take into account the change of legal basis following the entry into force of the Lisbon treaty",
				"2011":"The Council and the European Parliament find a political compromise over the establishment of the agency (June). It is tasked with the operational management of EURODAC, SIS II and VIS, but also with the preparation, development and operational management of other large-scale IT systems. The seat of the agency is divided between Strasbourg and Tallinn"
			}},
			{"id":"EUROPOL","events":{
				"1994":"In February, EDU - European Drug Unit - begins official operations with its scope limited to drug trafficking",
				"1995":"In March, EDU scope expanded to smuggling of nuclear materials, illegal immigration, trafficking of stolen vehicules",
				"1997":"In February, EDU's scope expanded to human trafficking and sexual exploitatation of children",
				"1998":"March: JHA Council approves agreement of K4Committee. Dec: JHA Council reaches an agreement on composition of Europol's Directorate General and on most aspects of rules of procedure for the Joint Supervisory Body and agreement to include in scope the fight against counterfeiting ot the euro",
				"1999":"In April, Special JHA Council: aggreed on Rules and Procedure for Joint Supervisory Body. Europol's mandate formally extended to combat counterfeiting of the euro",
				"2000":"Council Decision of 27th March authorises the Director of Europol to begin negotiating with third parties (non-MS, Interpol). In September, JHA council agrees to expand scope of Europol to money laundreing related to any crime; to set up a provisional Eurojust Unit, to adopt recommendation regarding how MS should deal with requests by Europol to initiate, coordinate or conduct investigations. In October,JHA Council: adopts decision to establish Secretariat for joint supervisory dat-protection body for Europol and the schengen agreememt. April : 1st Meeting of the Task Force of European Police Chiefs",
				"2001":"Council Decison of 6.01.2001provides an Agreement between  the  US and the European Police Office. Provides for limited sharing of information (not personal data) and exchange of liaison officers",
				"2002":"Supplementary agreement between Europol and the US on the exchange of personal data and related information (20 December 2002). Protocol amending the Convention  on the 28th November 2002 on the establishment of a European Police Office (Europol Convention) and the Protocol on the privileges and immunities of Europol, the members of its organs, the deputy directors and the employees of Europol.",
				"2005":"Council Decision 2005/681/JHA of 20 September 2005 establishing the European Police College (CEPOL) which is composed ot nationals of MS",
				"2009":"Entry in force of the Lisbon treaty. Article 88 TFEU provides for a new legal regime for EUROPOL. It stipulates that EUROPOL shall be governed by (a) regulation(s) to be adopted in accordance with the ordinary legislative procedure, thus potentially giving the European Parliament more control over the Office."
			}},
			{"id":"EUROPOL Convention","events":{
				"1994":"Feb: JHA Council decides not to include fight against terrorism in Europol Convention only later",
				"1995":"March JHA Council decides to include terrorism in scope of Europol Convetion 2years after its operational agrres to include directly traffick of nuclear substance, robbed vehicule, illegal immigration. In July, Signature of the Europol Convention, needs ratification of all MS to enter into force",
				"1996":"In July, Protocol to Europol Conv on role of ECJ is signed",
				"1997":"In June, JHA Council adopts Protocol to Europol on the Priviledges and Immuniites of Europe Personnel Multidisciplinary group on Organised Crime establi- shed within the Council to coordinate the works to fight organised crime",
				"1998":"In June, Belgium is the last MS to ratify Europol Convention. In October, Europol Convention enters into force but not operational, Lacks agreement on organisation of its Joint Supervisory Body, and Protocol on Priviliedges and Immunities not ratified by all MS",
				"1999":"1st July, Europol fully operationnal as France and Italy were the last to ratify the Protocol on Priviledges and Immunities EUROPOL is accountable to the Council of Ministers for Justice and Home Affairs EUROPOL serves as centre for coordinating information exchange. This is the principal function of Europol. It also serves as centre for collecting, analysing, and managing the information.",
				"2008":"Council Decision establishing the European Police Office 8706/08 of 24th June 2008. Council Decision establishing the European Police Office 8706/3/08 of 9th October 2008. Council Decision establishing the European Police Office 8706/03/08 REV 3 COR2 of the 3rd April 2009. These Decision replace the provisions of the Convention based on Article K.3 of the Treaty on European Union, on the establishment of a European Police Office (Europol Convention)."
				
			}},
			{"id":"Strategy-making in the AFSJ","events":{
				"1999":"Tampere European Council adopts the first multi-annual programme for the AFSJ, the 'Tampere milestones' (October)",
				"2003":"The High Representative for the Common Foreign and Security Policy presents the European Security Strategy. Although the document focuses on external security, it includes a number of issues related to traditionnally internal security concerns, such as organised crime or terrorism",
				"2004":"The Hague European Council adopts the second multi-annual programme for the AFSJ, the Hague Programme (December)",
				"2005":"The European Commission adopts its strategy on the external dimension of the AFSJ (October); The Council adopts a strategy on the external dimension of JHA (November)",
				"2009":"JHA Council adopts the Information Management Strategy for EU Internal Security (November)",
				"2009":"The Stockholm European Council adopts the third multi-annual programme for the AFSJ, the Stockholm Programme (December)",
				"2010":"The JHA Council adopts the European Union Internal Security Strategy (February)",
				"2010":"The European Commission tables its strategy for the effective implementation of the Charter of Fundamental Rights (November)"
			}},
			{"id":"OLAF","events":{
				"1999":"The Commission established within itself the European Anti-Fraud Office : ECSC Decision 1999/352 of 28th April. The office is given responsibility for conduction administrative anti-fraud investigations by having conferred on it a special independent status. Regualtion (EC) No 1073/1999 and Coucnil Regulation (Euratom) No1074/1999 of 25th May 1999 concerning the investigations carried out by OLAF enterred into force. The Office succeeded the Task Force for the coordination of Fraud Prevention which was part of the Secretariat General of the Commission (created in 88). It developed and manages the CIS. The European Commission's Justice and Home Affairs DG and the Taxation and Customs Union DG are also involved in the development of policy."	
			}},
			{"id":"EUROJUST","events":{
				"2002":"Council Decision of 28 February 2002 Based on Artilces 31 and 34(2)(c) TEU permanent body is established with the mission to enhance the development of cooperation on criminal justice cases throughout Europe. Eurojust has the power to ask the competent national authorities to undertake an investigation or prosecution of specific acts; to accept that one of them may be in a better position to undertake an investigation or to prosecute specific acts; to co-ordinate between the competent authorities; to set up a joint investigation team; or to provide any information necessary to carry out its tasks. Eurojust ensures the information exchange between the competent authorities and assists them in providing the best possible co-ordination and co-operation. Eurojust also co-operates with the European Judicial Network, Europol, and OLAF. Eurojust offers logistical support and may organise and facilitate co-ordination meetings between the judicial authorities and police authorities of the different states to help resolve legal issues and practical problems. Eurojust is composed of a college, composed of 27 National EU Members, majority of which are prosecutors and represent their own central authority It fulfils its tasks through its National Members or as a College.",
				"2003":"Council Decision 2003/659/JHA of 18 June 2003 amends Decision of 2002. Memorandum between Eurojust and OLAF (14.04.2003), see §3: Participation in joint investigation teams; §5: Communication of Inofrmation to Other Partners; §6: Collecting, Processing and Storage of Information",
				"2005":"Under the new team structure introduced at Eurojust, a special team was formed dedicated to work with EUROPOL and a special team was formed to work with OLAF",
				"2006":"Executive Agreement signed between the US and the UE (6th Novemeber) establishing the position of US Liaison Prosecutor at EUROJUST to be based at EUROJUST headquarters. It aims at facilitation law enforcement cooperation between the US and the EU on a day to day basis in the fields or organised crime, human trafficking, cybercrime and terrorism.",
				"2009":"The Council adopts Council Decision 2009/426/JHA on the strengthening of EUROJUST. The Decision strengthens the capacity of EUROJUST with regard casework. It makes new powers available to the agency, including with respect to access to information and co-ordination with national authorities. EUROJUST becomes host to the Secretariat of the network for Joint Investigation Teams (JITs)"
			}},
			{"id":"European Arrest Warrant","events":{
				"2002":"Council Framework decision of 13th June 2002 entry into force on1st january 2004"	
			}},
			{"id":"CEPOL","events":{
				"2000":"Following the Tampere European Council, the Council adopts Decision 2000/820/JHA establishing CEPOL (December). The Decision indicates that CEPOL is a network of national training institutes",
				"2005":"Following difficulties in the implementation of the CEPOL mandate, the Council adopts Decision 2005/681/JHA to provide the College with a legal personality, a permanent seat as well as the possibility to be subsidised by the Community budget"	
			}},
			{"id":"FRONTEX","events":{
				"2004":"originally created by Council regulation 2007/2004 of 26th October 2004. Community agency and an autonomous body with legal personality the Management Board: composed of one representative for each MS, one for each country “associated with the implementation application and development of the Schengen acquis” (Art.20.3)  and two for the Commission. Board members “shall be appointed on the basis of their degree of high level relevant experience and expertise in the field of operational cooperation on border management” (Art.20.2). The Management Board elects a Chairperson,  whose term in office is of two years, renewable once (Art.21). It is supposed to hold at least two regular meetings a year, and the Executive Director participates in the discussions (Art.23 - but he does not have the right to vote – Art.24.2). The Management board takes decision byabsolute majority voting (Art.24.1), and each of its members holds one vote(Art.24.2). the Executive director: he is in charge of the management of the agency. Frontex staff falls into two categories: officials recruited according to the relevant Community regulations, and seconded national experts recruited according to a September 2006 decision of the Management board (Frontex Management Board, 2006). The formal missions attributed to Frontex in its regulation therefore fall into three categories: a) Technical and operational assistance at the borders: b) Provision of expertise; c) Return operations, and particularly for “grouped” operations. Moreover, Frontex has provided risk analyses and feasibility studies to the European institutions. The agency has realised a series of risk analyses, including a contribution to the Europol 2006 and 2007 OCTA (‘Organised CrimeThreat Assessment’), and at least two feasibility studies (MEDSEA and BORTEC)",
				"2006":"Frontex has also been involved in the development of a European Patrol Network (EPN). The EPN came into the picture as a request issued in the Presidency conclusions of the December 2006 Brussels European Council. It currently consists of a permanent joint operation co-ordinated by Frontex with a selected group of MS (Cyprus, France, Greece, Italy, Malta, Portugal, Slovenia and Spain) in specific areas of the Mediterranean and the Atlantic, for migration control purposes.",
				"2007":"The European Parliament and the Council adopted Regulation (EC) 863/2007 ‘establishing a mechanism for the creation of Rapid Border Intervention Teams’ (the so-called ‘RABIT Regulation’) RABITs are essentially a pool of officials from the border guard agencies and services of the countries participating in Frontex, which can be upon request deployed, under the authority of the requesting country, in order to  provide additional support to national border guardagencies and services.",
				"2010":"In April 2010, the Council adopts Decision 2010/252/EU supplementing the Schengen Borders Code. The Decision specifies the rules applicable in the context of sea border operations coordinated by FRONTEX. It explicitly enshrines respect for fundamental rights, including the principle of non-refoulement in disembarkation operations, as a clear operation requirement",
				"2011":"Council and Parliament reach agreement over the revision of the FRONTEX Regulation. The revision should grant the agency an enhanced role in joint operations and pilot projects and the possibility of access to personal data (for the purpose of coordinating joint return operations). The revision should also clarify the legal obligations of FRONTEX with regard fundamental rights"
			}},
			{"id":"Data Protection","events":{
				"2008":"Council Framework Decison 2008/977/JHA on the protection of personnal data processed in the framework of police and judicial cooperation in criminal matters",
				"2010":"The European Commission tables a communication on a comprehensive approach to the right to data protection in the European Union. It advocates in particular the adoption of a single legal instrument which would include police and judicial cooperation matters"
			}}
		],
		"EU databases and information network":[
			{"id":"SIS","events":{
				"1985":"C-SIS (central system): Information on a) persons wanted for arrest/ estradition purposes; b) third country nationals to be refused entry into the Schengen territory c) Missing persons (minors and adults) or persons that for their own protection need temporarily to be placed under police protection; d) Witnesses and persons required to appear before judicial authorities; e) Persons to be put under discreet surveillance or subjected to specific checks, Data elements include among others: names including aliases, specific physical characteristic, place and date of birth, sex, nationality, whether the person is armed, violent or has escaped, action to be taken. Information on objects will also be collected, a) vehicules, boats, aircrafts, containers for the purpose of discreet surveillance or specific checks; b) objects sought for the purposes of seizure or use as evidence in criminal proceedings (eg; stolen identity cards…) The information is supplied by contracting states via national sections (N-SIS), They are all connected to the SIS Authorities who are responsible for border checks, other police and customs checks caried out within the country and judicial authorities as designated by the contracting states have access to this database. Partial access can be granted to visa and immigration authorities. Europol and Eurojust have partial access. In practice a wide ranging set of national authorities  have access to SIS: from police, state security services, public prosecutors and judges, customs authorities, ministerial departements, immigration offices and vehicle registration authorities. A list of all auhtorites for all participating states having access to SIS is provided in Council doc. 6073/2/07 REV 2,25.6.2007",
				"2006":"SIS I 4all. Council JHA adopted this project in December 2006 Temporary solution in orde to include 9 MS to the existing SIS I Enabled the extension of Schengen area to 9 new MS in 2007",
				"2007":"Eurojust national members allowed access to the system"
			}},
			{"id":"CIS","events":{
				"1995":"Customs Information Systems Convention, 27th November 1995: Legal basis for the Intergovermental Database sets out the procedures to be adopted in the use of information technology for customs purposes It outlines the broad parameters of information that may be stored, the manner in which information can be amended, security systems and data-protection provisions. The main categories of information collected relate to: a) commodities, b) means of transport, c) business, d) persons for the purposes of soughting and reporting, discreet surveillance or specific checks and only if there are real indications to suggest that the person concerned has committed, is in the act of committing or will commit serious contraventions of national laws. Data elements include names (mariden name, aliases) date and place of birth, nationlality, sex, particular objective and permanent objectives, reason for inclusion of data, suggested action, warning code indicating and history of being armed, violent or escaping. Data revealing racial origin, political opinions or religious beliefs or other beliefs, as well as personnal data concerning health or sexual life shall not be registered The inclusion of data is governed by national laws of MS Direct access to data is reserved exclusively for the national authorities designated by each Member State (such as customs administrations) and may be used only to achieve the convention's aim. Only the supplying Member State will have the right to modify data which it has included in the CIS. Access can be granted to international and regional organisation. Data retrieved from the system may also by used by other national authorities than those who have direct acess. source: http://ec.europa.eu/justice_home/fsj/customs/informsystem/fsj_customs_informsystem_en.htm"
			}},
			{"id":"SIRENE","events":{
				"1985":"SIRENE, Supplementary Information Requests at the National Entries is also established The SIRENE system provides national contact point in each of the Schengen countries providing data to the computerised SIS"	
			}},
			{"id":"TECS Europol Computer System","events":{
				"1999":"TECS consists of 3 elements: 1) The Information System, 2) Analytical Work Files, 3) The Index System 1) The Information System embodies information on a) suspects or convicted persons of a crime; b) possible future offenders. Data elements include; surname; maiden name, given names; aliases; or assumed names, date and place of birth, nationality, sex, specific physical characteristics. MS, represented by their national units and liaison officers.Europol Itself shall input data supplied by third states and third bodies as well as anaylisis data. The ones who have access are national units, liaison officers, the Director as well as suly empowered Europol officials. 2) Analytical Work Files embodies a) suspects or convicted persons of a crime; b) possible future offenders; c) possible witness d) Victims and possible victims; e) contacts and associates; e) persons who can provide information on the criminal offence under consideration. Analyst and other Europol official specifically designated for each analysis project add their inputs. Experts from third states and third bodies may be associated with the activities of an analysis group. Have access: Analyst and other Europol official specifically designated for each analysis project. The liaison officers and/or experts of the MS which are concerned by the analysis file; Experts from third states and third bodies may be associated with the activities of an analysis group. 3) Index System is created by Europol. The Director, Deputy Directors, duly empowered Europol officials and liaison officers have access."
			}},
			{"id":"EURODAC","events":{
				"2000":"Council Regulation No 2725/200 of 11 December 2000 concerns the establishment of Eurodac for the comparison of fingerprints for the effective application of the Dublin Convention, Entry into force the 15th Dec and Council regulation No 407/2002of 28 February 2002 Information on a) applicants for asylum b) Persons apprehended in connection with the irregular crossing of borders coming from a third country, Data elements include among others: fingerprints and control images member state of origin, place and date of application for asylum, sex, reference number used by member of state of origin, date on which fingerprints were taken, The system also allows checking fingerprints of persons found illegaly present in a member state with the existing fingerprints stored in the Eurodac, However, the data of these persons are not stored Participating states  and the Eurodac national acess points are the authorities feeding the data- base. In theory this should only be national authorities in charge of handling asylum request. In some member states, however, Eurodac is operated parlty or entirely by national police services (European Data Protection Supervisor 2007) All 27 MS are particpating in this database as well as Norway, Iceland, switzerland and soon Liechtenstein"	
			}},
			{"id":"Convention on Mutual Assistance in Criminal Matters","events":{
				"2000":"adopted on 19.07.2000 Convention established by the Council in accordance with Article 34 of the TEU. The purpose is to improve judicial cooperation in criminal matters between MS without prejudie to the rules protecting individal freedom. Any relevant information linked to the investigation or prosecution of crime with or without a specific request by one MS can be exchanged. Special provision foreseen for requests for interception of telecommunications transmission. An additionnal Protocol to the Convention stipulates conditions of obtaining information on bank accounts and banking transactions (OJ C326,22.11.2001)"	
			}},
			{"id":"VIS","events":{
				"2004":"Council Decision of 8 June  establishing the Visa Informatin System. Proposition of a Regulation of the European Parliament and of the Council concerning the VIS and the exchange of data between MS on short stay visas .",
				"2006":"Commission Proposal for a regulation of the European Parliament and of the council ammending the Common Consular Instructions on visas for diplomatic missions and consular posts in relation to the introduction of biometrics including provisions on the organisation of the reception and processing of visa applications COM (2006) 269 (31.05.2006)",
				"2007":"Council Decision concerning access for consultation on the VIS by designated authorities of MS and by Europol for the purposes of prevention, detection, investigation of terrorist offences and other serious criminal offences (1.10.2007).",
				"2008":"Adoption of the Regualtion on VIS No 767/2008. Information on visa applicants, application procedure, and visa history of the applicant.This includes fingerprints and photographs and a) surname, surname of birth, first names, sex, date, place and country of birth; b) current nationality and nationality at birth; c) type and number of travel documents, issuing authority, date of issue and expiry; d) place and date of appliction; e) type of visa requested; f) details of the person issuing an invitation and/or liable to pay the applicant subsistencecosts during the stay; g) main destination and duration of intended stay; h) pupose of travel; i) intended date of arrival and departure; j) intended border of first entry or transit route; k) resience; l) current occupation and employer; for students: name of shool; m) in the case of minors, names of father and mother. Information on links to previous applications and between applicants travelling together will also be collected Access is authorised to Visa, immigration and asylum authorities as designated by participating states. Competent authorities responsible for carrying out checks at external border crossing points in accordance with Schengen Border Code. On request in specific case also designated authorities for the purpose of prevention, detection or inverstigation or terrorist offences and other serious criminal offences as well as Europol within the limits of its mandate and when necessary to perfom its task. Under specific circumstances VIS data can be transferred to third countries or to an international organisation VIS data obtained for the purpose of counter terrorism and crime should in prinicple bot be tranferred to third countries or international organisations, but it is allowed in exceptionnal case of emergencies.",
				"2011":"The roll-out of VIS begins (October) in 'first region' countries (Algeria, Egypt, Libya, Mauritania, Morocco and Tunisia)"
			}},
			{"id":"Passenger Data","events":{
				"2004":"Council Directive 2004/82/EC of 29th April 2004 on the obligation ofcarriers to communicate passenger data. Based on Articles 62(2)(a) and 63 (3)(b)TEC. The purpose is to imporve border controls and combat illegal immigration. Gather and exchange advance passenger data: number and type of travel document used; nationality; full names; date of birth; border crossing point of entry into the territory of the MS; code of transport; depature and arrival time; total number of passengers, initial point of  embarkation. Carriers must transmit advance passenger data by the end of check-in concerning the passengers they will carry to an authorised border crossing point through which the passenger will enter the territory of a MS. Carriers are defined as any natural or legal person whose occupation is to provide passenger transport by air. The authorities involved are the ones responsible for carrying out checks on persons at external borders. Personal data may also be used for law enforcement purposes subject to data protection provisions of Directive 95-46 - first pillar data protection directive. Denemark has opt out of this Directive but Iceland and Norway are partcipating."	
			}},
			{"id":"Terrorist Offences","events":{
				"2005":	"Council decision 2005/671/JHA of 20th September 2005 on the exchange of information concerning terrorist offences is adopted on the basis of Articles 29,30 (1), 31 and 34 (2) (c)TEU The purpose of the decision is the Fight against terrorism and the fact that relevant services need to have fullest and most up -to-date information as possible. Europol shall receive all relevant information concerning and resulting from criminal investigations conducted by law enforcement authorities in MS with respect to terrrorist offences. Eurojust shall receive all relevant information concernning prosecutions and investigations for terrorist offences in MS. Specialised service within MS police forces to make contact with Europol are involved. Eurojust national correspondents for terrorism matters or other competent authorities as well as Eurojust and Europol."
			}},
			{"id":"Criminal Records","events":{
				"2005": "Council decision 2005/876/JHA of 21st November 2005 on the exchange of information extracted from the criminal record is adopted on the basis of Articles 31 and 34 (2) (c)TEU. The purpose of the decision is to provide citizens with a high level of security within an area of freedom, security and justice and to facilitate exchange of information concerning criminal convictions of persons who reside in the territory of the MS between the competent authorities of the MS. The information exchanged are the criminal convictions of EU citizens and subsequent measures. Information is normally provided on the basis of a formalised request procedure. However, if a national of one MS is convicted in another MS, the latter must inform the central authority of the other MS automatically and withou delay. The authorities involved are one or more unspecified 'central authority' in each MS"	
			}},
			{"id":"Proposals: principle of availability","events":{
				"2005":"Commission proposed on the basis of Articles 30 (1) (b) and 34 (2) (b) TEU a Council Framework decision on the exchange of information under the principle of availability (COM (2005) 409 final, 12.10.2005). The purpose of the decision is to provide citizens with a high level of security within an area of freedom, security and justice and to lay down an obligation for MS to give access or to provide certains types of inforamtion avalable to their authorities to equivalent authorities of other MS and Europol in so far as these authorities need this information to fulfill thei lawful tasks for the prevention, detection or investigation of criminal offences prior to the commencement of a criminal procedure. Extend online access to national database to all equivalent authorities to MS and Europol The proposed exchange of information or access to concerns: DNA analysis files; Dactyloscopic data, Ballistics, Vehicle registration data, Telephone and other communications data; Minimum data for the identification of persons contained in civil registers. Exchange should be possible via national contact points"	
			}},
			{"id":"Proposal: Organisation and content of the exchange of information extracted from criminal records","events":{
				"2005":"Commission proposed on the basis of Articles 31 and 34 (2) (b) TEU a Council Framework decision COM (20 05) 690 final, 22.12.2005). This proposal is intended to repeal the decision listed on the exchange of information extracted from the criminal records. The purpose of this proposal is a) to define the ways in which a MS in which a conviction is handed down against a national of another MS may transmit such a conviction to the MS of the convicted person's nationality; b) to define storage obigations for the MS of the person's nationality and to specify the methods to be followed when responding to a request for information taken from criminal records; c) to lay down the framework for a computerised conviction-information exchange system between MS to be built and developed."	
			}},
			{"id":"CMS","events":{
				"2005":"Eurojust Regulation. Established an autonomous system of data management named Case Management System. The aim of the CMS is the safe exchange of judicial information between Eurojust members and national judicial authorities As of 2006, Eurojus started  developping a system of data treatment, using the E-POC (European Pool against Organised Crime) project framework."
			}},
			{"id":"ICONet","events":{
				"2005":"the ‘Information and Coordination Network for Member States' Migration Management Services’, established by Council Decision 2005/267/EC of 16 March 2005 has been operational since 2006 under the supervision of the European Commission ICONet ‘is primarily designed to facilitate the exchange of strategic and tactical information on irregular or illegal migratory flows and trends. Secondly, the ICONet decision envisaged the following contents for the network: an ‘early-warning system’ (EWS),  a link between immigration liaison officers (ILO),information on documents . used in illegal immigration, and ‘return-related’ issues (Art.2.2) ICONet is further supposed to contain the contact details of ILO central contact points and ILOs of Member States, as well as information on forgeries of documents and smuggling of persons. Finally, ICONet also operates in the field of ‘return’, and gathers a wide range of information regarding the expulsion of irregularly staying persons",
				"2010":"Following the modifications in the Council's working structures after the entry into force of the Lisbon treaty, CIREFI is discontinued and control of ICONet is entrusted to FRONTEX."
			}},
			{"id":"SIS II","events":{
				"2006":"Schengen Information System II, Regulation No.1987 /2000 of the European Parliament the Council of the 20th December 2006 Information on a) persons wanted for arest for surrender purposes on the basis of a European arrest warrant or wanted for extradition purposes. In case of an EAW, supplementary information specific to the EAW procedure has to be communicated; b) third country nationals to be refused entry into the Schengen territory; c) Missing persons; d) Witnesses and persons required to appear before judicial authorities; e) persons to be put under discreet checks or subjected to specific checks. Supplementary information has to be provided in these cases. Data elements include: names, previous names, birth names, aliases, specific physical characteristics, place and date of birth, sex, photographs, fingerprints, nationalities, whether the person is armed, violent or has escaped, action to be taken, links to other alerts issued in SIS II. Data revealing racial origin, political opinions or religious or other beliefs, as welll as personnal data concerning health or sexuality shall not be registered. Information on objects are also collected: a) vehicules, boats, aircrafts, containers for the purpose of discreet surveillance or specific checks; b) objects sought for the purposes of seizure or use as evidence in criminal proceedings (eg; stolen identity cards…). Information is supplied by contracting states via national interfaces (NI-SIS). Authorities responsible for the identification of third country nationals for the purposes of border control, other police and customs checks carried out within the country and judicial authorities as designated by contracting states. Partial access can be ganted to visa and immigration policies. Partial access by vehicle registration authorites, Partial access by Europol and Eurojust. Personnal data processed in SIS II  shall not be transferred to third countries or international organisations, However passeport number, country of issuance nd the document type stolen, lost, misappropriated, lost or inval passeports enterred in SIS II may be exchanged with interpol. Should be operational in Sept 2009"	
			}},
			{"id":"Data retention","events":{
				"2006":"Directive 2006/24/EC of the European Parliament and of the Council of 15th March on the retention of data generated or processed in connection with the provision of publicly available electonic communications services or public communications network and amending Directive 2002/58/EC Based on Article 95 TEC Purpose is the harmonisation of MS's provisions concerning the obligations of providers of publicly available electronic communications services or of public communications network with respect to the retention of certain data which are generated or processed by them, in order to ensure that the data are availbale for the purposed of the investigation, detection and prosecution of serious crime, as defined by each MS in national law. Gathering and exchange of information on X held by Y concerns traffic location data on legal entities, natural persons and related data as necessary to identify the subscriber or user generated or processed by provides publicly available electronic communications services or of public communications networks. The content of the communication is not stored. For more details on the catgories od data, see Art 5 of the directive. The authorities involved are the ones competent  at the national level.",
				"2011":"The European Commission publishes a report on the evaluation of the implementation of the Data Retention Directive by Member States. The report is tabled after several decisions from Constitutional Courts (Bulgaria, Germany, Romania) which have annulled implementing legislation adopted by these Member States"	
			}},
			{"id":"Proposal: Stepping up cross-border cooperation","events":{
				"2007":"This Proposal is a Prüm initiative in the view of adopting a Council Decision particularly in combating terrorism and cross-border crime (OJ C 74, 28.3.2007) Based on Articles 30(1)(a) and (b), 31(1)(a), 32 and 34 (2)(c)EU The purpose of this initiative is to give citizens a high degree of security for developping common procedures among MS in the field of police and judicial cooperation in criminal matters This Initiative makes the essential parts of the Prüm Treaty of 27May 2005 applicable to all MS. It opens a new dimension of crime fighting by networking MS national database. The proposed exchange of information are: DNA analysis files for investigation of criminal offences; Dactyloscopic data for prevention and investigation of criminal offences; Vehicle registration data for prevention and investigation of criminal offences and in dealing with other offences coming within the jurisdiction of the courts or the publis prosecutions service in the searching MS, as well as maintaining public order and security; Exchange of personal and non-personnal data in connection with major events with a cross-border dimension for prevention of criminal offences and in maintaining public order and security for major events in particular sporting events or European Council meetings; Exchange of personal information for the prevention of terrorist offences in so far as necessary because particular circumstances give reason to believe that the data subjects will commit terrorits offences as defined in Council Framework decision of 13th June 2002 on combatting terrorism. Sall be involved: National contact points designated by MS and agencies responsible for the prevention and investigation of criminal offences"	
			}},
			{"id":"EU-PNR Proposal","events":{
				"2007":"Commission proposal for a Council Framework Decision on the use of PNR for law enforcement purposes, COM (2007) 654 final, 6.11.2007 Based on Articles 29, 30(1)(b) and 34(2)(b) TEU It would provide for the making availbale by air carriers of PNR data of passengers of international flights to the competent authorities of the MS, for the purpose of preventing and combating terrorist offences and organised crime, as well as the collection and retention of those data by the these auhtorities and the exchange of those data between them. PNR data collected and processed in air carriers' reservation systems by air carriers operating international flighs to or from the territory od one or more MS of the EU (no intra-EU flights).The 'Push system' is the preferred method and should be mandatory for all carriers established in the EU.PNR data include: Data for all passengers : Data of reservation/issue of ticket; Dates of intended travel; Names; Adress and Contact Information,  all available payment /billing information; Travel itinerary; Frequent flyer information: Travel agency; Travel status of passenger including confirmations, checks-in status, no show or go show information Ticketing field information, including ticket neumber, date of ticket issuance and one-way tickets, Automated Ticket fare quote fields; Seat number; All baggage information; Number and other names of of travellers on PNR; All historical changes. Additional data for unaccompanied minors under 18 years would also be requested: Names and gender of child; Age; Language spoken; Name and contact details of guardian on departure and relationship to the child; Name and contact details of guardian on arrival and relationship to the child; Departure and arrival agent. ",
				"2011":"The European Commission tables a new proposal for a European PNR system (February)"
			}},
			{"id":"Cooperation of Asset Recovery Offices","events":{
				"2007":"Council decison 2007/845/JHA of 6th December 2007 established cooperation between Asset Recovery Offices of the MS in the field of tracing and identification of proceeds from, or other property, related to, crime. Based on Articles 30 (1) (a) and (b), 34 (2) (c) TEU The purpose of the decisicon is to investigate and analyse financial trails of criminal activity in order to combat organised crime effectively. Information for the purposes of the facilitation of the tracing and identification of proceeds of crime and other crime related property which may become the object of  a freezing, seizure or confiscation order made by a competent judidicial authority can be exchanged. This entails details on the property targeted or sought and/or the natural or legal persons presumed to be involved. Asset Recovery Services are to be set or designated by MS"	
			}},
			{"id":"Border Control Systems","events":{
				"2002":"A study on the control of the EU's maritime borders, commissioned by the European Commission and conducted by the French consultancy Civipol Conseil, recommends the creation of a maritime border surveillance system, possibly drawing on the Spanish experience with the SIVE.",
				"2005":"The European Commission's communication on interoperability and synergies between EU databases envisages the possibility of establishing an EU Entry/Exit system and an EU Registered Traveller Programme.",
				"2008":"The European Commission tables its 'border package' (February), comprising three communications. The first one focuses on the the future development of Frontex and considers the possibility of granting the agency access to personal data, the second on examining ‘the creation of a European Border Surveillance System (EUROSUR)’, the third one on 'Preparing the next steps in border management in the European Union. The package envisages the creation of several new databases, including an EU Entry/Exit system and an EU Registered Traveller Programme, a European Electronic System of Travel Authorisation (ESTA) and a European Border Surveillance System (EUROSUR).",
				"2011":"The European Commission tables a communication on EU 'smart borders' which envisages the creation of an EU Entry/Exit system and an EU Registered Traveller Programme. It postpones until 2012 the discussion on the establishment of a European Electronic System of Travel Authorisation (ESTA)"	
					
			}}
				
		],
		"External Dimension":[
			{"id":"EU-US Agreement on Mutual Legal Assistance","events":{
				"2003":"signed in july 2003 to combat crime in a more effective way as a means of protecting the EU's and the US's democratic societies and common values. Based on Articles 24 and 38 TEU Council decision of 6 June concerns the signature of the Agreements between the EU and the US on extradition and mutual legal assistance in criminal matters. Any relevant information linked to the investigation or prosecution of crime under certain conditions can be exchanged, Special provison foresee as regards bank information of natural or legal persons suspected of or charged with a criminal offence. Designated national authorites of MS and the US responsible for investigation or prosecution of criminal offences can be involved. Administrative authorities can profit form the Agreement provied they are competent to investigate criminal offences according to national law."	
			}},
			{"id":"Passeport Data with Interpol","events":{
				"2005":"Council Common Position 2005/69/JHA of 24th January on exchanging certain data with Interpol. The purpose of this position is to prevent and combat serious and organised crime, including terrorism, based on Article 30(1) (b), 34 (2) (a) TEU. The exchange of information concerns present an future data on issued and blank passeports, which are stolen, lost or misappropirated. MS are obliged to exchange this information with the Interpol database on Stolen Travel Document, in parallel to entering them in the relevant national database and the SIS. EU MS's law enforcement authorities, Interpol as well as the Interpol MS are involved in the exchange of information"	
			}},
			{"id":"EU PNR agreements with other countries","events":{
				"2006":"EU-Canada PNR Agreement. Council decision of 18th July 2005 on the processing of Advance Passenger Information (API) and Passenger Name Record (PNR) data. Commission decision of 6th September on the adequate protection of personnal data contained in the Passenger Name Record of air passengers transferred to the Canada Border Services Agency. Based on Articles 95, 300(2) and (3) TEC Purpose is to ensure that the API/PNR data of persons on eligible journeys is provides in full respects of fundamental rights and freedoms, in particular the right to privacy. Gathering and exchange of inforamtion on X held by Y concerns API and PNR data contained in reservation  system or air carriers located within the Community that operate flights form the Community to Canada. API data elements include: person's names; date of birth; Gender, Citizenship/nationality; Type, Issuing country and number of travel document. PNR data elements include: Name, API data, Date of intended travel; Date of reservation; Date of ticket issuance Travel agencies; Travel agent; contact telephone information; Billing adress; all forms of payment information; Travel itinerary; Travel status of passenger; Ticketing information, Bag tag numbers; Seat information including seat number; all historical changes. Sensitive data (eg:racial, ethnic origin, political opinions, religious or philosophical beliefs) will not be gathered. Authorities involved are the ones responsible in Canada or in the EU for processing API/PNR data. For Canada: Canada Border Services Agency (CBSA) Under certain circumstances and in a limited way, data may be disclosed to other Canadian departments, agencies and third states.",
				"2007":"EU-US PNR Agreement.Council Decison 2007/551/CFSP/JHA of 23rd July on the processing and transfer of PNR data by air carriers to the United States Department of Homeland Security Based on Articles 24 and 38 TEU. Purpose is to prevent and combat terrorism and transnational effectively as a means of protecting the Eu's and the US's democratic societies and common values. Gathering and exchange of information on X held by Y concerns PNR data contained in reservation systems of air carriers located within the EU that operate passenger flights in foreign air transportation to or from the US. Transfer will be automated (push/pull system) Types of PNR data include: Data of reservation/issue of ticket; Dates of intended travel; Names; Availbale frequent flyer and benefit information; all available payment /billing information; Travel itinerary; Travel agency; Travel status of passenger; Ticketing information; All baggage information; Seat information; All historical changes. Authority involved: United States Department of Homeland Security. Analytical information flowing from PNR may be exchanged between US and MS's police and judicial authorities as well as Europol and Eurojust Sensitive data (eg:racial, ethnic origin, political opinions, religious or philosophical beliefs) will not be gathered. Authorities responsible for collecting PNR data are Passenger Information Unit (PIU) for each MS (2 or more MS may establish joint PIUs), Are also responsible for carrying out risk assessments of passengers. PIUs then transmit the PNR data requiring further examination to the relevant competent of the same MS. Competent authorites shall only include authorities responsible for the prevention or combating of terrorist offences and organised crimes. Each MS shall adopt a list of the auhtoriites entitled to receive PNR data from the PIU. PIU of MS are allowed to exchange PNR data among themselves, to transmit it to their competent authorities and to request it form each other. Under certain conditions law enforcement authorities of third MS may receive PNR data from MS.",
				"2008":"EU-Australia PNR Agreement. Council Decision 2008/9946/JHA on the processing and transfer of European Union-sourced passenger name record (PNR) data by air carriers to the Australian Customs Service of th 30th June 2008 vital border security tool for Australia.  It will assist in the fight against terrorism and serious crimes. Customs’ handling of personal information,  such as its collection, use, disclosure, access, storage and security is governed by Australian privacy laws. The PNR Agreement will allow for information about travellers flying into Australia on airlines using EU-based IT service providers to be disclosed to Australian Customs officials. The data comprises 19 categories of information including   passport details, travel itineraries and payment details, but will not include sensitive personal information such as race or religion. According to TEU Article 24(5): that Agreement is currently binding on a provisional basis only on those Member States which did not issue statements to the effect that they had to comply with their own constitutional procedure, as did Belgium, the Czech Republic, Germany, Ireland, Latvia, Hungary, Malta, the Netherlands, Poland and Finland"
					
			}}	
		]
    },
    "edges": [
    	{
			"source":"[Community Developpments][EUROJUST][2006]",
			"target":"[External Dimension][EU PNR agreements with other countries][2007]"
		},
    	{
			"source":"[Community Developpments][European agency for the operational management of large-scale IT system][2009]",
			"target":"[EU databases and information network][EURODAC][2000]"
		},
    	{
			"source":"[Community Developpments][Council Working Structures][1992]",
			"target":"[EU databases and information network][EURODAC][2000]"
		},
   		{
			"source":"[Community Developpments][TREVI 92][1992]",
			"target":"[Community Developpments][EUROPOL][1994]"
		},
    	{
			"source":"[European Police Cooperation][Pompidou group][1987]",
			"target":"[Community Developpments][European Drugs Monitoring Centre][1989]"
		},
		{
			"source":"[European Police Cooperation][Treaty of Prüm][2005]",
			"target":"[EU databases and information network][Proposal: Stepping up cross-border cooperation][2007]"
		},
		{
			"source":"[Community Developpments][Schengen Agreement][1985]",
			"target":"[EU databases and information network][SIS][1985]"
		},
		{
			"source":"[Community Developpments][EUROPOL Convention][1999]",
			"target":"[EU databases and information network][TECS Europol Computer System][1999]"
		},
		{
			"source":"[Community Developpments][EUROPOL][2001]",
			"target":"[External Dimension][EU-US Agreement on Mutual Legal Assistance][2003]"
		},
		{
			"source":"[European Police Cooperation][EUROPOL Project Group][1992]",
			"target":"[Community Developpments][EUROPOL Convention][1996]"
		},
		{
			"source":"[European Police Cooperation][AD HOC Immigration Group][1986]",
			"target":"[Community Developpments][CIREA-CIREFI][1992]"
		},
		{
			"source":"[Community Developpments][JHA Council][1994]",
			"target":"[Community Developpments][EUROPOL Convention][1994]"
		},
		{
			"source":"[Community Developpments][JHA Council][1995]",
			"target":"[Community Developpments][EUROPOL Convention][1995]"
		},
		{
			"source":"[Community Developpments][EDU][1997]",
			"target":"[Community Developpments][JHA Council][1997]"
		},
		{
			"source":"[Community Developpments][EUROPOL][1999]",
			"target":"[Community Developpments][JHA Council][1999]"
		},
		{
			"source":"[Community Developpments][FRONTEX][2004]",
			"target":"[EU databases and information network][ICONnet][2005]"
		},
		{
			"source":"[European Police Cooperation][Treaty of Prüm][2005]",
			"target":"[EU databases and information network][Proposal: Setting up cross-border cooperation][2007]"
		},
		{
			"source":"[External Dimension][Passeport Data with Interpol][2005]",
			"target":"[EU databases and information network][SIS][2006]"	
		}
		
	],
	"types":{
		"terrorism":[
			
		],
		"type A!":[
			"[European Police Cooperation][Star Group (Standige Arbeitsgruppe Rauschgift)][1978]",
			"[European Police Cooperation][Treaty of Prüm][2005]"
		],
		"type B!":[
			"[European Police Cooperation][Star Group (Standige Arbeitsgruppe Rauschgift)][1978]",
			"[European Police Cooperation][Treaty of Prüm][2005]"
		]
	}
}